In [2]:
import pandas as pd

sample_1=pd.read_excel('datasalon-master\\2_Start_DataAnalysis\\files\\sample_1.xlsx', #엑셀 파일 불러오기, 경로 지정
                            header=1, #칼럼명이 있는 위치. 파이썬에서는 시작 숫자가 0이르모 두 번째 로우는 1로 표현
                            skipfooter=2, #마지막 로우에서 두 줄은 생략하고 불러오기
                            usecols='A:C') # A칼럼부터 C칼럼까지 불러옴

In [15]:
#데이터 통합 - 옆으로, 아래로
sample_1['기준년월']='2019-11'
sample_1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [16]:
code_master=pd.read_excel('datasalon-master\\2_Start_DataAnalysis\\files\\sample_codemaster.xlsx')
code_master

  국적코드     국적명
0  A01      일본
1  A02      대만
2  A03      홍콩
3  A18      중국
4  A19      이란
5  A22  우즈베키스탄
6  A23   카자흐스탄
7  A99  아시아 기타

In [28]:
sample_1_code=pd.merge(left=sample_1, #merge는 자료를 가로로 합친다.
                        right=code_master, # 오른쪽은 code_master
                        how='left', # 왼쪽 테이블을 기준으로 두 테이블을 결합
                        left_on='국적코드', # 왼쪽 테이블의 기준 칼럼은 국적코드
                        right_on='국적코드') # 오른쪽 테이블의 기준 칼럼은 국적코드
sample_1_code # 국적코드가 A31인 경우 국적명이 NaN으로 나온다. code_master에는 해당하는 자료가 없기 때문.

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국

In [27]:
sample_1_code=pd.merge(left=sample_1,
                        right=code_master,
                        how='inner', # 두 테이블의 기준 칼럼이 일치하는 경우에만 데이터 통합
                        left_on='국적코드', 
                        right_on='국적코드') 
sample_1_code

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성  106320  2019-11  일본
1  A01  여성  191436  2019-11  일본
2  A18  남성  158912  2019-11  중국
3  A18  여성  232943  2019-11  중국

In [24]:
#데이터 아래로 통합(ex.월별로 관리)
sample_2=pd.read_excel('datasalon-master\\2_Start_DataAnalysis\\files\\sample_2.xlsx', 
                        header=1, 
                        skipfooter=2, 
                        usecols='A:C')
sample_2['기준년월']='2019-12'
sample_2_code=pd.merge(left=sample_2, 
                        right=code_master, 
                        how='left', 
                        left_on='국적코드',
                        right_on='국적코드')
sample_2_code

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성   92556  2019-12  일본
1  A01  여성  163737  2019-12  일본
2  A18  남성  155540  2019-12  중국
3  A18  여성  249023  2019-12  중국

In [25]:
#ignore_index=True 를 입력하지 않으면 원래 데이터에서의 인덱스 값으로 합쳐짐
sample=sample_1_code.append(sample_2_code) # append()로 아래로 통합. 
sample

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성  106320  2019-11  일본
1  A01  여성  191436  2019-11  일본
2  A18  남성  158912  2019-11  중국
3  A18  여성  232943  2019-11  중국
0  A01  남성   92556  2019-12  일본
1  A01  여성  163737  2019-12  일본
2  A18  남성  155540  2019-12  중국
3  A18  여성  249023  2019-12  중국

In [26]:
# sample_1_code와 sample_2_code의 칼럼 순서가 동일하다면 두 데이터를 아래로 통합할 수 있다!!!
sample=sample_1_code.append(sample_2_code, ignore_index=True) # append()로 아래로 통합. 
sample

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성  106320  2019-11  일본
1  A01  여성  191436  2019-11  일본
2  A18  남성  158912  2019-11  중국
3  A18  여성  232943  2019-11  중국
4  A01  남성   92556  2019-12  일본
5  A01  여성  163737  2019-12  일본
6  A18  남성  155540  2019-12  중국
7  A18  여성  249023  2019-12  중국

In [29]:
# 데이터 저장
sample

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성  106320  2019-11  일본
1  A01  여성  191436  2019-11  일본
2  A18  남성  158912  2019-11  중국
3  A18  여성  232943  2019-11  중국
4  A01  남성   92556  2019-12  일본
5  A01  여성  163737  2019-12  일본
6  A18  남성  155540  2019-12  중국
7  A18  여성  249023  2019-12  중국